It works, tested on `vcd_vapp_vm`, as you can see `vapp_template_id` # forces replacement
```
  # vcd_vapp_vm.my-vms["AS-01"] must be replaced
-/+ resource "vcd_vapp_vm" "my-vms" {
      + cpu_limit                      = (known after apply)
      + cpu_priority                   = (known after apply)
      + cpu_reservation                = (known after apply)
      + cpu_shares                     = (known after apply)
      ~ description                    = <<-EOT
            vRAM: 41 MB, so I set to 48.
            vDisk: 45 MB. It's thin provisioned anyway.
            I don't install VMware Tools as that will add 200 MB.
            No password. auto-login.
            Simple GUI.
            DHCP.
        EOT -> (known after apply)
      ~ hardware_version               = "vmx-09" -> (known after apply)
      ~ href                           = "https://vcd/api/vApp/vm-f1f044f4-91e0-48cf-8bd2-da0a95989ea1" -> (known after apply)
      ~ id                             = "urn:vcloud:vm:f0f264f4-92e0-48cf-8bd2-da0a95989ga1" -> (known after apply)
      ~ vapp_template_id               = "urn:vcloud:vapptemplate:b9557b02-48eb-47ee-bd17-a8f6d7b03136" -> "urn:vcloud:vapptemplate:fd76f267-070a-4f1d-8715-e7728faa2b41" # forces replacement
      ~ vm_type                        = "vcd_vapp_vm" -> (known after apply)
        # (13 unchanged attributes hidden)
      . . .
    }
```

when you add lifecycle block
```
No changes. Your infrastructure matches the configuration.
```